#1) Напишите программу, которая принимает на вход вещественное число 
# и показывает сумму его цифр.

#*Пример:*

#- 6782 -> 23
#- 056 -> 11

n = input('Введите вещественное число: ')
sum = sum(map(int, n.replace('.', '')))
print (sum)